{
  "serv_trapTitle" : "Grease Trap Service",
  "serv_trapDescription" : "The American Grease Trap cleaning methodology integrates both common grease cleaning methods. This approach utilizes several procedures that accomplish the most efficient grease trap cleaning service in the industry today. Using our portable hi capacity wet vacuum, we pump-out all the FOGs, non-floatable solids and water accumulated in the grease trap. We thoroughly scrape all the surfaces, inner baffles and the air release by-pass vent. This is followed by a Power wash and/or rinse on all surfaces to deodorize.  Next we apply liquid form, bacteria additive in the trap and drains. Finally we clean and deodorize the adjacent floor area ",
  "serv_filterTitle" : "Grease Filter Service",
  "serv_filterDescription" : "Since 1992 American has been providing an economical and dependable, kitchen exhaust grease filter cleaning service, to more than 200 quality-oriented customers, located in Northern NJ and NYC. Our service consists in replacing the greasy and often-clogged grease filters with professionally cleaned ones. Our trained personnel usually perform this exchange within a few minutes, minimizing any interruptions to the kitchen operations. The replaced greasy filters are transported to our plant where they go through (undergo) our proven-effective cleaning procedures. The filters are submerged in our custom made, stainless steel tank, containing 180* F water combined with our special formula of environmentally friendly soaps and de-greasers. After 24hrs, the filters are removed from the tank and undergo a thorough rinse and meticulous inspection.",
  "serv_exhaustTitle" : "Exhaust Systems Cleaning",
  "serv_exhaustDescription" : "<b>The American hydro cleaning methodology</b> integrates the scrape and wipe clean method with our unique power wash method. This approach utilizes a hi-pressure, hi-temperature power washing machine. Complete manual scraping of all the grease accumulated on the exhaust system. The means to properly dispose of wash water, using our custom build wet/dry-self pump out filtering vacuum equipment. Complete drying and polishing of all the surfaces of the exhaust hood, back-splash wall and exterior of the adjacent cooking equipment. This methodology facilitates an extended complimentary service of power washing and eliminating all grease, dirt and food waste accumulated in hard to reach areas, including the back-splash wall behind the cooking equipment and the adjacent kitchen floor under such equipment.<br><b>The American hydro cleaning method accomplishes the most efficient exhaust system cleaning service while providing a comprehensive kitchen area and equipment cleaning maintenance.</b>"
}
